---
layout:     post
title:      "计算机网络实验之访问控制列表"
subtitle:   "访问控制列表（ACL）配置"
date:       2016-12-20 21:00:00
author:     "林佩勤"
header-img: "img/post-bg.jpg"
tags:
    - 计算机网络
---

> 对不起，你不能从这过去！


## 前言

为了管理网络中逐步增长的IP数据以及过滤数据，访问控制列表经常会使用到，今天就讲讲如何配置访问列表

---

## 正文

**访问列表设置命令**

```shell
#Step 1：设置访问列表测试语句的参数
#所有主机: 0.0.0.0 255.255.255.255可以用 any 简写
Router(config)# access-list access-list-number { permit | deny } { test conditions }

#Step 2：在端口上应用访问列表
#指明是进方向还是出方向缺省 = 出方向
#“no ip access-group access-list-number” 命令在端口上删除访问列表。
#这里的protocol常为ip、tcp、udp、icmp、igrp等
Router(config-if)# { protocol } access-group access-list-number {in | out} 
```

**扩展IP访问列表配置**

```shell
#设置访问列表的参数
Router(config)# access-list access-list-number  { permit | deny } protocol source source-wildcard [ operator port ] destination destination-wildcard [ operator port ]  [ other parameters ]
#在端口上应用访问列表
Router(config-if)# ip access-group access-list-number  { in | out }
#举例：拒绝子网172.16.4.0 的数据使用路由器E0口ftp到子网172.16.3.0，允许其它数据
Router(config)# access-list 101 deny tcp 172.16.4.0 0.0.0.255 172.16.3.0 0.0.0.255 eq 21
Router(config)# access-list 101 deny tcp 172.16.4.0 0.0.0.255 172.16.3.0 0.0.0.255 eq 20
Router(config)# access-list 101 permit ip any any
Router(config)# interface ethernet 0
Router(config-if)# ip access-group 101 out
#查看访问列表
Router#show ip int e0
#查看访问列表的语句
router# show access-lists {access-list number}
```

## 后记

控制访问列表的配置还是蛮重要的，应该要好好掌握。